test_plans/sampleapis_spike_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter.version="5.6">
  <hashTree>

    <!-- ═══════════════════════════════════════════════
         TEST PLAN
         The root container for all test elements.
         serialize_threadgroups=false → run groups in parallel
    ════════════════════════════════════════════════ -->
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan"
              testname="POST api.sampleapis.com Performance Test" enabled="true">
      <stringProp name="TestPlan.comments">Generated by JMeter MCP Server</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.arguments" elementType="Arguments">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>

    <hashTree>

      <!-- ═══════════════════════════════════════════════
           THREAD GROUP
           Simulates virtual users (threads).
           num_threads  = concurrent users
           ramp_time    = seconds to reach full user count
           loops / scheduler control how long the test runs
      ════════════════════════════════════════════════ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="Users - 3 Concurrent" enabled="true">

        <!-- How many virtual users to simulate -->
        <stringProp name="ThreadGroup.num_threads">3</stringProp>

        <!-- Seconds to ramp up to full thread count -->
        <stringProp name="ThreadGroup.ramp_time">3</stringProp>

        <!-- Loop count: -1 means loop forever (use with scheduler) -->
        <stringProp name="ThreadGroup.num_threads">3</stringProp>

        <elementProp name="ThreadGroup.main_controller"
                     elementType="LoopController" guiclass="LoopControlPanel"
                     testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>

        <!-- Scheduler: when true, 'duration' controls test length in seconds -->
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">2</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>

      </ThreadGroup>

      <hashTree>

        <!-- ═══════════════════════════════════════════════
             HTTP REQUEST SAMPLER
             Sends the actual HTTP/HTTPS request.
        ════════════════════════════════════════════════ -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui"
                          testclass="HTTPSamplerProxy"
                          testname="POST /countries/countries" enabled="true">
          <stringProp name="HTTPSampler.domain">api.sampleapis.com</stringProp>
          <stringProp name="HTTPSampler.port">443</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/countries/countries</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>

        <!-- ═══════════════════════════════════════════════
             HTTP HEADER MANAGER
             Adds common headers to every request.
        ════════════════════════════════════════════════ -->
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                       testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Content-Type" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="Accept" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <!-- ═══════════════════════════════════════════════
             RESPONSE ASSERTION
             Marks a sample as FAILED if the HTTP status
             code is not in the 2xx range.
        ════════════════════════════════════════════════ -->
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                           testname="Assert HTTP 2xx" enabled="true">
          <collectionProp name="Asserion.test_strings">
            <stringProp name="49586">2[0-9][0-9]</stringProp>
          </collectionProp>
          <!-- TEST_TYPE 2 = "matches" (regex); 8 = "contains" -->
          <intProp name="Assertion.test_type">2</intProp>
          <!-- RESPONSE_CODE = check the HTTP status code field -->
          <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
          <boolProp name="Assertion.assume_success">false</boolProp>
        </ResponseAssertion>
        <hashTree/>

        <!-- ═══════════════════════════════════════════════
             CONSTANT TIMER  (think time)
             Adds a 500 ms pause between requests to
             simulate realistic user think time.
        ════════════════════════════════════════════════ -->
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer"
                       testname="Think Time 500ms" enabled="true">
          <stringProp name="ConstantTimer.delay">500</stringProp>
        </ConstantTimer>
        <hashTree/>

        <!-- ═══════════════════════════════════════════════
             SUMMARY REPORT listener
             Writes results to a .jtl CSV file.
             filename is empty here; supplied at runtime
             via -l flag or hard-coded path below.
        ════════════════════════════════════════════════ -->
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector"
                         testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>

      </hashTree><!-- end ThreadGroup hashTree -->

    </hashTree><!-- end TestPlan hashTree -->

  </hashTree><!-- end root hashTree -->
</jmeterTestPlan>